# Question 1

In [2]:
def c(a):
    return a+2

In [3]:
a=0
def b():
    global a
    a=c(a)

In [4]:
b() ##Global a gets 0+2 and gets stored in a

1.we have kept a=0 which is a global variable as it is outside of function and initialed value of a is 0

2.when b() is getting executed for the first time we have kept global a that means that in b() function wherever we will refer to a it will be the global a not the local a.

3.a= c(a) so it will call c() function and the global value of a is passed to c function as a parameter.

4.c() will be executed in which it is basically taking a and returning a+2 i.e value of a will be increased by 2

5.The pointer returns back to a=c(a) and the value returned from c() function will be stored in global a as it is in b().

6.The value of a will be 0+2 after this execution, hence the value of a will be 0+2 i.e a=2.

In [5]:
b()

1.The value of global a is already 2 which was done in last step

2.Now when b() is called global a will be referred to a value and in b() function wherever we will refer to a it will be the global a not the local a.

3.a= c(a) so it will call c() function and the global value of a is passed to c function as a parameter.

4.c() will be executed in which it is basically taking a and returning a+2 i.e value of a will be increased by 2

5.The pointer returns back to a=c(a) and the value returned from c() function will be stored in global a as it is in b().

6.The already value of a was 2 and after this execution the value will be 2+2 i.e a=4.

In [6]:
b()

1.The value of global a is already 4 which was done in last step

2.Now when b() is called global a will be referred to a value and in b() function wherever we will refer to a it will be the global a not the local a.

3.a= c(a) so it will call c() function and the global value of a is passed to c function as a parameter.

4.c() will be executed in which it is basically taking a and returning a+2 i.e value of a will be increased by 2

5.The pointer returns back to a=c(a) and the value returned from c() function will be stored in global a as it is in b().

6.The already value of a was 2 and after this execution the value will be 4+2 i.e a=6.

In [7]:
a

6

# Question 2

In [8]:
def fileLength(f_name):
    try:
        file = open(f_name)
        values = file.read()
        file.close()
        print(len(values))
    except FileNotFoundError:
        print(f"File {f_name} is not found.")
    
        

fileLength(r'C:\Users\Ajay Maraviya\Desktop\test.txt')
fileLength(r'C:\Users\Ajay Maraviya\Desktop\test123.txt')

16
File C:\Users\Ajay Maraviya\Desktop\test123.txt is not found.

# Question 3

In [9]:
class Marsupial: 
    def __init__(self):
        self.pouch = []
    
    def pouch_contents(self):
        return self.pouch
    
    def put_in_pouch(self, item):
        self.pouch.append(item)
        
class Kangaroo(Marsupial):
    def __init__(self, x=0, y=0):
        super().__init__()
        self.x = x
        self.y = y

    def jump(self, dx, dy):
        self.x += dx
        self.y += dy

    def __str__(self):
        return f"I am a Kangaroo located at coordinates ({self.x},{self.y})"

    
m = Marsupial()
m.put_in_pouch('doll')
m.put_in_pouch('firetruck')
m.put_in_pouch('kitten')
m.pouch_contents()
print(m.pouch_contents())

['doll', 'firetruck', 'kitten']

In [10]:
k = Kangaroo(0,0)
print(k)
k.put_in_pouch('doll')
k.put_in_pouch('firetruck')
k.put_in_pouch('kitten')
print(k.pouch_contents())
k.jump(1,0)
k.jump(1,0)
k.jump(1,0)
print(k)

I am a Kangaroo located at coordinates (0,0)
['doll', 'firetruck', 'kitten']
I am a Kangaroo located at coordinates (3,0)

# Question 4

In [11]:
def collatz(x):
    print(x)
    if x == 1:
        return 
    elif x % 2 == 0:
        x = x // 2
        return collatz(x)
    else:
        x = 3 * x + 1
        return collatz(x)

print('collatz(1)')        
collatz(1)
print('collatz(10)')
collatz(10)

collatz(1)
1
collatz(10)
10
5
16
8
4
2
1

# Question 5

In [12]:
def binary(n):
    if n <0: 
        print("Enter a non negative number")
    elif n==0:
        return
    else :
        binary(n//2)
    print(n%2,end='')

In [13]:
binary(9)

1001

In [14]:
binary(7)

111

# Question 6

In [15]:
from html.parser import HTMLParser


class HeadingParser(HTMLParser):
    def __init__(self):
        super().__init__()
        self.indentation = 0
        self.headings = []

    def handle_starttag(self, tag, attrs):
        if tag.startswith('h') and tag!='html' and tag!='head':
            self.indentation = int(tag[1:])

    def handle_data(self, data):
        if self.indentation >= len(self.headings):
            self.headings.append(data.strip())

    def print_headings(self):
        for heading in self.headings:
            print(heading + '\n\n')


infile = open(r'C:\Users\Ajay Maraviya\Desktop/w3c.html')
content = infile.read()
infile.close()
hp = HeadingParser()
hp.feed(content)
hp.print_headings()

W3C Mission


Principles

# Question 7

In [15]:
import requests
from bs4 import BeautifulSoup

def webdir(url, depth, ind):
    if depth == 0:
        return
    resp = requests.get(url)
    soup = BeautifulSoup(resp.content, 'html.parser')
    print(' ' * ind + url)
    for l in soup.find_all('a'):
        href = l.get('href')
        if href and href.startswith('http'):
            webdir(href, depth - 1, ind + 1)
webdir('https://www.youtube.com/',2 , 0)

https://www.youtube.com/
 https://www.youtube.com/about/
 https://www.youtube.com/about/press/
 https://www.youtube.com/about/copyright/
 https://www.youtube.com/creators/
 https://www.youtube.com/ads/
 https://developers.google.com/youtube
 https://www.youtube.com/about/policies/
 https://www.youtube.com/howyoutubeworks?utm_campaign=ytgen&utm_source=ythp&utm_medium=LeftNav&utm_content=txt&u=https%3A%2F%2Fwww.youtube.com%2Fhowyoutubeworks%3Futm_source%3Dythp%26utm_medium%3DLeftNav%26utm_campaign%3Dytgen

# Question 8

In [19]:
import pandas as pd
import sqlite3

# Creating sqlite3 database
conn = sqlite3.connect('Weatherdata.db')

# Creating table 
conn.execute('''CREATE TABLE seasons_data
            (City TEXT, Country TEXT, Season TEXT, Temperature FLOAT, Rainfall FLOAT)''')

# Inserting data into the seasons_data table
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Winter', 24.8, 5.9)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Spring', 28.4, 16.2)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Summer', 27.9, 1549.4)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Mumbai', 'India', 'Fall', 27.6, 346.0)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Winter' , 4.2,207.7)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Spring' , 8.3,169.6)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Summer' , 15.7,157.0)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('London' , 'United Kingdom' , 'Fall' , 10.4,218.5)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Winter' , 13.6, 16.5)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Spring' , 20.7, 6.5)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Summer' , 27.7, 0.1)")
conn.execute("INSERT INTO seasons_data (City, Country, Season, Temperature, Rainfall) VALUES ('Cairo', 'Egypt', 'Fall' , 22.2, 4.5)")

In [20]:
a = pd.DataFrame(conn.execute("SELECT Temperature FROM seasons_data"))

a.columns = ['Temperature']
a

    Temperature
0          24.8
1          28.4
2          27.9
3          27.6
4           4.2
5           8.3
6          15.7
7          10.4
8          13.6
9          20.7
10         27.7
11         22.2

In [21]:
b = pd.DataFrame(conn.execute("SELECT DISTINCT City FROM seasons_data"))

b.columns = ['City']
b

     City
0  Mumbai
1  London
2   Cairo

In [22]:
c = pd.DataFrame(conn.execute("SELECT * FROM seasons_data WHERE Country='India'"))

c.columns = ['City', 'Country', 'Season', 'Temperature', 'Rainfall']
c

     City Country  Season  Temperature  Rainfall
0  Mumbai   India  Winter         24.8       5.9
1  Mumbai   India  Spring         28.4      16.2
2  Mumbai   India  Summer         27.9    1549.4
3  Mumbai   India    Fall         27.6     346.0

In [23]:
d = pd.DataFrame(conn.execute("SELECT * FROM seasons_data WHERE Season='Fall'"))

d.columns = ['City', 'Country', 'Season', 'Temperature', 'Rainfall']
d

     City         Country Season  Temperature  Rainfall
0  Mumbai           India   Fall         27.6     346.0
1  London  United Kingdom   Fall         10.4     218.5
2   Cairo           Egypt   Fall         22.2       4.5

In [24]:
e = pd.DataFrame(conn.execute("""
    SELECT City, Country, Season
    FROM seasons_data
    GROUP BY City, Country, Season
    HAVING AVG(Rainfall) BETWEEN 200 AND 400
"""))

e.columns = ['City', 'Country', 'Season']
e

     City         Country  Season
0  London  United Kingdom    Fall
1  London  United Kingdom  Winter
2  Mumbai           India    Fall

In [25]:
f = pd.DataFrame(conn.execute("""
    SELECT City, Country
    FROM seasons_data
    WHERE Season='Fall'
    GROUP BY City, Country
    HAVING AVG(Temperature) > 20
    ORDER BY AVG(Temperature)
"""))

f.columns = ['City', 'Country']
f

     City Country
0   Cairo   Egypt
1  Mumbai   India

In [26]:
g = pd.DataFrame(conn.execute("""
    SELECT SUM(Rainfall) AS total_annual_rainfall
    FROM seasons_data
    WHERE City='Cairo'
"""))

g = g.rename(columns={0: 'Total Annual Rainfall'})
g

   Total Annual Rainfall
0                   27.6

In [27]:
h = pd.DataFrame(conn.execute("""
    SELECT Season, SUM(Rainfall) AS total_rainfall
    FROM seasons_data
    GROUP BY Season
"""))
h = h.rename(columns={0: 'Season', 1: 'Total Rainfall'})
h

   Season  Total Rainfall
0    Fall           569.0
1  Spring           192.3
2  Summer          1706.5
3  Winter           230.1

In [28]:

# Commit changes and close the connection
conn.commit()
conn.close()

# Question 9

In [29]:
words = ['The', 'quick', 'brown', 'fox', 'jumps', 'over',
'the', 'lazy', 'dog']

print('a> ',end='')
w_up=[word.upper() for word in words]
print(w_up)

print('b> ',end='')
w_lo=[word.lower() for word in words]
print(w_lo)

print('c> ',end='')
w_len=[len(word) for word in words]
print(w_len)

print('d> ',end='')
w_ull=[[word.upper(),word.lower(),len(word)] for word in words]
print(w_ull)

print('e> ',end='')
w_ull=[ word for word in words if len(word)>3]
print(w_ull)

a> ['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']
b> ['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']
c> [3, 5, 5, 3, 5, 4, 3, 4, 3]
d> [['THE', 'the', 3], ['QUICK', 'quick', 5], ['BROWN', 'brown', 5], ['FOX', 'fox', 3], ['JUMPS', 'jumps', 5], ['OVER', 'over', 4], ['THE', 'the', 3], ['LAZY', 'lazy', 4], ['DOG', 'dog', 3]]
e> ['quick', 'brown', 'jumps', 'over', 'lazy']